#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/maxfrise/maxfrise-infra/runs/run-RDSrnFroXQXJ4DHH

Waiting for the plan to start...

Terraform v1.4.2
on linux_amd64
Initializing plugins and modules...
module.sample_lambda.null_resource.build_lambda_function: Refreshing state... [id=2286704084450896528]
module.sample_s3_lambda.data.archive_file.source: Refreshing...
module.sample_s3_lambda.data.archive_file.source: Refresh complete after 0s [id=29c8ec19253c695dab1e5d1419ea010b15df2a2e]
module.sample_s3_lambda.aws_iam_role.iam_for_lambda: Refreshing state... [id=iam_lambda_s3]
module.sample_lambda.aws_iam_role.iam_for_lambda: Refreshing state... [id=iam_for_lambda]
module.sample_s3_lambda.aws_s3_object.file_upload: Refreshing state... [id=./modules/lambdaexample/src/dist/lambda.zip]
module.s3_bucket.aws_s3_bucket.lambda_bucket: Refreshing state... [id=testing-submodules-resources]
module.sample_lambda.aws_lambda_function.hello-terraform: Refreshing state... [id=hello-terraform]
module.sample_s3_lambda.aws_s3_object.file_upload: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.sample_lambda.null_resource.build_lambda_function must be replaced
-/+ resource "null_resource" "build_lambda_function" {
      ~ id       = "2286704084450896528" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "build_number" = "2023-06-12T05:28:17Z" -> (known after apply)
        }
    }

  # module.sample_s3_lambda.aws_lambda_function.lamba_s3_example will be created
  + resource "aws_lambda_function" "lamba_s3_example" {
      + architectures                  = [
          + "arm64",
        ]
      + arn                            = (known after apply)
      + description                    = "Example of a lambda where the code lives on s3"
      + function_name                  = "lambdaS3Example"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::914036813947:role/iam_lambda_s3"
      + runtime                        = "nodejs18.x"
      + s3_bucket                      = "maxfrisedeployables"
      + s3_key                         = "sample_s3_lambda_lambda.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "ezzC3IaErSEZ0TYLxBJBaMTGmR5VkoGkbzu2JghpFxU="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 900
      + version                        = (known after apply)
    }

  # module.sample_s3_lambda.aws_s3_object.file_upload must be replaced
-/+ resource "aws_s3_object" "file_upload" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "8d5a9d4a145192abcb6ffe34f2ce5b11" -> (known after apply)
      ~ id                     = "./modules/lambdaexample/src/dist/lambda.zip" -> (known after apply)
      ~ key                    = "./modules/lambdaexample/src/dist/lambda.zip" -> "sample_s3_lambda_lambda.zip" # forces replacement
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 3 to add, 0 to change, 2 to destroy.

```

</details>

*Pushed by: @saudelog, Action: `pull_request`*